Cambié formato de diagrama a mermaid.
